export const exchangeLectureCategoryMap = {
  예술: ['회화', '조각', '공예'],
  음악: ['악기', '작곡', '보컬'],
  언어: ['영어', '한국어', '스페인어'],
  컴퓨터: ['웹 개발', '데이터', '인공지능'],
  패션: ['스타일링', '메이크업', '헤어'],
  스포츠: ['PT', '요가', '필라테스']
};

export const categoryEnumMap = {
  언어: 'LANGUAGE',
  '음악/악기': 'MUSIC',
  '미술/디자인': 'ART',
  '공예/수공예': 'CRAFT',
};

export const koreaLocationCategoryMap = {
  서울특별시: 'SEOUL',
  부산광역시: 'BUSAN',
  대구광역시: 'DAEGU',
  인천광역시: 'INCHEON',
  광주광역시: 'GWANGJU',
  대전광역시: 'DAEJEON',
  울산광역시: 'ULSAN',
  세종특별자치시: 'SEJONG',
  경기도: 'GYEONGGI',
  강원특별자치도: 'GANGWON',
  충청북도: 'CHUNGBUK',
  충청남도: 'CHUNGNAM',
  전북특별자치도: 'JEONBUK',
  전라남도: 'JEONNAM',
  경상북도: 'GYEONGBUK',
  경상남도: 'GYEONGNAM',
  제주특별자치도: 'JEJU',
};

export const univCategory = {
  인문과학대학: ['국어국문학과', '중어중문학과', '불어불문학과', '독어독문학과', '사학과', '철학과', '기독교학과', '영어영문학부'],
  사회과학대학: ['정치외교학과', '행정학과', '경제학과', '문헌정보학과', '사회학과', '사회복지학과', '심리학과', '소비자학과'],
  자연과학대학: ['수학과', '통계학과', '물리학과', '화학나노과학과', '생명과학과'],
  공과대학: ['융합전자반도체공학부', '전자전기공학전공', '지능형반도체공학전공', '식품생명공학과', '화공신소재공학과', '건축학과', '건축도시시스템공학과', '환경공학과', '기후에너지시스템공학과', '휴먼기계바이오공학과'],
  음악대학: ['건반악기과', '관현악과', '성악과', '작곡과', '한국음악과', '무용과'],
  조형예술대학: ['조형예술학부', '동양화전공', '서양화전공', '조소전공', '도자예술전공', '디자인학부', '공간디자인전공', '시각디자인전공', '산업디자인전공', '영상디자인전공', '섬유패션학부', '섬유예술전공', '패션디자인전공'],
  사범대학: ['교육학과', '유아교육과', '초등교육과', '교육공학과', '특수교육과', '영어교육과', '사회과교육과', '국어교육과', '과학교육과', '수학교육과', '언어병리학과', '영재교육협동과정'],
  경영대학: ['경영학부'],
  신산업융합대학: ['융합콘텐츠학과', '의류산업학과', '국제사무학과', '식품영양학과', '융합보건학과', '체육과학부'],
  의과대학:['의과대학'],
  간호대학: ['간호학전공', '글로벌건강간호학전공'],
  약학대학: ['약학과'],
  스크랜튼대학: ['스크랜튼학부', '뇌인지과학부', '국제학부', '국제학전공', '글로벌한국학전공'],
  인공지능대학: ['인공지능데이터사이언스학부', '컴퓨터공학과', '사이버보안학과', '인공지능전공', '데이터사이언스전공'],
  호크마교양대학: ['호크마교양대학'],
};